Revit 2024 API
UIThemeManager Members
The UIThemeManager type exposes the following members.
Methods
Name | Description
GetThemeName
 Gets the theme name for the given theme type.
Properties
Name | Description
CurrentCanvasTheme
 current canvas theme.
CurrentTheme
 The current overall theme which impacts the Revit frame and canvas.
DefaultTheme |  Obsolete.
 The default theme.
FollowSystemColorTheme
 Indicate if the overall theme follows operating system color theme.
See Also
UIThemeManager Class
Autodesk.Revit.UI Namespace